In [13]:
from sklearn import linear_model
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from word2number import w2n

In [14]:
df = pd.read_csv('hiring.csv')

In [15]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [16]:
df.experience = df.experience.fillna("zero")

In [17]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [19]:
df.experience = df.experience.apply(w2n.word_to_num)

In [20]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    NaN                           7      72000
7          11                    7.0                           8      80000

In [21]:
import math
median_test_score = math.floor(df['test_score(out of 10)'].mean())

In [22]:
median_test_score

7

In [25]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_test_score)

In [26]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    7.0                           7      72000
7          11                    7.0                           8      80000

In [27]:
reg = linear_model.LinearRegression()

In [32]:
reg.fit(df[['experience','test_score(out of 10)', 'interview_score(out of 10)']].values, df['salary($)'])

LinearRegression()

In [36]:
print(reg.predict([[0,5,5]]))

[36836.60977647]